{
    "references": [
        "Albers A, Braun A, Clarkson J, Enkler H-G, Wynn D (2009) Contact and Channel Modelling to support early design of technical systems. In: Proceedings of the 17th International Conference on Engineering Design (ICED09), pp 61–72",
        "Albers A, Matthiesen S, Revfi S, Schönhoff C, Grauberger P, Heimicke J (2019) Agile lightweight design - The extended target weighing approach in ASD - Agile systems design using functional modelling with the C&C2-approach. Proc. Int. Conf. Eng. Des. 1:2667–2676. https://doi.org/10.1017/dsi.2019.273",
        "Ameri F, Summers JD, Mocko GM, Porter M (2008) Engineering design complexity: an investigation of methods and measures. Res Eng Design 19:161–179. https://doi.org/10.1007/s00163-008-0053-2",
        "Andreasen MM, Hansen CT, Cash P (2015) Conceptual Design. Springer International Publishing, Cham",
        "Aranburu A, Justel D, Contero M, D. Camba J (2022) Geometric Variability in Parametric 3D Models: Implications for Engineering Design. Procedia CIRP 109:383–388. https://doi.org/10.1016/j.procir.2022.05.266",
        "Atherton M, Jiang P, Harrison D, Malizia A (2018) Design for invention: annotation of functional geometry interaction for representing novel working principles. Res Eng Design 29:245–262. https://doi.org/10.1007/s00163-017-0267-2",
        "Baxter D, Gao J, Case K, Harding J, Young B, Cochrane S, Dani S (2008) A framework to integrate design knowledge reuse and requirements management in engineering design. Robotics and Computer-Integrated Manufacturing 24:585–593. https://doi.org/10.1016/j.rcim.2007.07.010",
        "Beetz J-P, Schlemmer PD, Kloberdanz H, Kirchner E (2018) USING THE NEW WORKING SPACE MODEL FOR THE DEVELOPMENT OF HYGIENIC PRODUCTS. In: Proceedings of International Design Conference, DESIGN, pp 985–996",
        "Berselli G, Meng Q, Vertechy R, Castelli VP (2016) An improved design method for the dimensional synthesis of flexure-based compliant mechanisms: optimization procedure and experimental validation. Meccanica 51:1209–1225. https://doi.org/10.1007/s11012-015-0276-z",
        "Bilancia P, Berselli G, Bruzzone L, Fanghella P (2017) A Practical Method for Determining the Pseudo-rigid-body Parameters of Spatial Compliant Mechanisms via CAE Tools. Procedia Manufacturing 11:1709–1717. https://doi.org/10.1016/j.promfg.2017.07.374",
        "Boersting P, Keller R, Alink T, Eckert C, Albers A, Clarkson PJ (2008) The relationship between functions and requirements for an improved detection of component linkages. In: 10th International Design Conference, DESIGN 2008, pp 309–316",
        "Bonev M, Hvam L, Clarkson J, Maier A (2015) Formal computer-aided product family architecture design for mass customization. Computers in Industry 74:58–70. https://doi.org/10.1016/j.compind.2015.07.006",
        "Browning TR (2016) Design Structure Matrix Extensions and Innovations: A Survey and New Opportunities. IEEE Trans. Eng. Manage. 63:27–52. https://doi.org/10.1109/TEM.2015.2491283",
        "Cao DX, Fu MW (2011) A Knowledge-Based Prototype System to Support Product Conceptual Design. Computer-Aided Design and Applications 8:129–147. https://doi.org/10.3722/cadaps.2011.129-147",
        "Chakrabarti A, Shea K, Stone R, Cagan J, Campbell M, Hernandez NV, Wood KL (2011) Computer-Based Design Synthesis Research: An Overview. J. Comput. Inf. Sci. Eng. 11:21003. https://doi.org/10.1115/1.3593409",
        "Chen RR, Liu YS, Cao Y, Zhao JJ, Yuan L, Fan HR (2018) ArchME: A Systems Modeling Language extension for mechatronic system architecture modeling. AIEDAM 32:75–91. https://doi.org/10.1017/S0890060417000245",
        "Danjou S, Lupa N, Koehler P (2008) Approach for Automated Product Modeling Using Knowledge-Based Design Features. Computer-Aided Design and Applications 5:622–629. https://doi.org/10.3722/cadaps.2008.622-629",
        "Dantan JY, Qureshi AJ, Antoine JF, Eisenbart B, Blessing L (2013) Management of product characteristics uncertainty based on formal logic and characteristics properties model. CIRP Annals 62:147–150. https://doi.org/10.1016/j.cirp.2013.03.077",
        "Eifler T, Howard TJ (2018) The importance of robust design methodology: case study of the infamous GM ignition switch recall. Res Eng Design 29:39–53. https://doi.org/10.1007/s00163-017-0251-x",
        "Eisenbart B, Gericke K, Blessing LTM (2017) Taking a look at the utilisation of function models in interdisciplinary design: insights from ten engineering companies. Res Eng Design 28:299–331. https://doi.org/10.1007/s00163-016-0242-3",
        "Elwert M, Ramsaier M, Eisenbart B, Stetter R (2019) Holistic digital function modelling with graph-based design languages. Proc. Int. Conf. Eng. Des. 1:1523–1532. https://doi.org/10.1017/dsi.2019.158",
        "Elwert M, Ramsaier M, Eisenbart B, Stetter R, Till M, Rudolph S (2022) Digital Function Modeling in Graph-Based Design Languages. Applied Sciences (Switzerland) 12. https://doi.org/10.3390/app12115301",
        "Eppinger SD, Browning TR (2012) Design structure matrix methods and applications. Engineering systems. MIT Press, Cambridge, Mass, USA",
        "Fang HC, Ong SK, Nee A (2014) Product Remanufacturability Assessment based on Design Information. Procedia CIRP 15:195–200. https://doi.org/10.1016/j.procir.2014.06.050",
        "Favi C, Mandolini M, Campi F, Germani M (2021) A CAD-based design for manufacturing method for casted components. Procedia CIRP 100:235–240. https://doi.org/10.1016/j.procir.2021.05.061",
        "Feldhusen J, Grote K-H (eds) (2013) Pahl/Beitz Konstruktionslehre: Methoden und Anwendung erfolgreicher Produktentwicklung, 8th edn. Springer Vieweg, Berlin, Heidelberg",
        "Freund T, Kloberdanz H, Wuertenberger J, Lotz J (2015) An Approach to Analysing Interface Uncertainty using the Contact and Channel Model. In: DS 80-6 Proceedings of the 20th International Conference on Engineering Design (ICED 15) Vol 6: Design Methods and Tools - Part 2, pp 53–62",
        "Gadeyne K, Pinte G, Berx K (2014) Describing the design space of mechanical computational design synthesis problems. Advanced Engineering Informatics 28:198–207. https://doi.org/10.1016/j.aei.2014.03.004",
        "Gao FJL, Z. Q. Qian, X. J. Wang, Z. M. Bi, W. J. Zhang (2015) A novel approach to embodiment design of a robotic system for maximum workspace. 2015 IEEE 10th Conference on Industrial Electronics and Applications (ICIEA)):539–544. https://doi.org/10.1109/ICIEA.2015.7334170",
        "Gericke K, Eisenbart B (2017) The integrated function modeling framework and its relation to function structures. AIEDAM 31:436–457. https://doi.org/10.1017/S089006041700049X",
        "Gladysz B, Albers A (2018a) C&C²-AFM - An embodiment design- and function-based approach for Analysis of Failure Mechanisms. Procedia CIRP 70:53–58. https://doi.org/10.1016/j.procir.2018.03.244",
        "Gladysz B, Albers A (2018b) How Do C&C²-Models Improve Efficiency, Comprehensibility and Scope In Failure Analysis-an Empirical Study Based on Two Live-Labs. In: Proceedings of International Design Conference, DESIGN, pp 1127–1138",
        "Gladysz B, Megner T, Mayer MP, Albers A (2018) How do C&C2-models improve the understanding of system behaviour in failure analysis? In: DS 91: Proceedings of NordDesign 2018",
        "Goel AK, Vattam S, Wiltgen B, Helms M (2012) Cognitive, collaborative, conceptual and creative — Four characteristics of the next generation of knowledge-based CAD systems: A study in biologically inspired design. Computer-Aided Design 44:879–900. https://doi.org/10.1016/j.cad.2011.03.010",
        "Grauberger P, Goetz S, Schleich B, Gwosch T, Matthiesen S, Wartzack S (2020a) A CONCEPTUAL MODEL COMBINATION FOR THE UNIFICATION OF DESIGN AND TOLERANCING IN ROBUST DESIGN. Proc. Des. Soc.: Des. Conf. 1:157–166. https://doi.org/10.1017/dsd.2020.12",
        "Grauberger P, Heimicke J, Nann S, Albers A, Matthiesen S (2020b) A guideline for modelling relations of embodiment and function in agile development. SN Appl. Sci. 2. https://doi.org/10.1007/s42452-020-03271-3",
        "Grauberger P, Bremer F, Sturm C, Hoelz K, Wessels H, Gwosch T, Wagner R, Lanza G, Albers A, Matthiesen S (2020c) QUALITATIVE MODELLING in EMBODIMENT DESIGN - INVESTIGATING the CONTACT and CHANNEL APPROACH through ANALYSIS of PROJECTS. Proceedings of the Design Society: DESIGN Conference 1:897–906. https://doi.org/10.1017/dsd.2020.260",
        "Grauberger P, Wessels H, Gladysz B, Bursac N, Matthiesen S, Albers A (2020d) The contact and channel approach–20 years of application experience in product engineering. Journal of Engineering Design 31:241–265. https://doi.org/10.1080/09544828.2019.1699035",
        "Grauberger P, Bremer F, Pfaff F, Tröster P, Nelius T, Eisenmann M, Stöberl T, Albers A, Matthiesen S (2022) Gaining insights through qualitative modelling - industrial project analysis with focus on derived hypotheses based on the contact and channel approach. Procedia CIRP 109:478–483. https://doi.org/10.1016/j.procir.2022.05.281",
        "Grauberger P, Eisenmann M, Stoitzner J, Matthiesen S (2021) Enhancing design method training with insights from educational research–improving and evaluating a training course for a qualitative modelling method. SN Appl. Sci. 3. https://doi.org/10.1007/s42452-021-04817-9",
        "Gu C-C, Hu J, Peng Y-H, Li S (2012) FCBS model for functional knowledge representation in conceptual design. Journal of Engineering Design 23:577–596. https://doi.org/10.1080/09544828.2011.629318",
        "He B, Huang S (2016) Functional synthesis of mechanisms under cost consideration. Proceedings of the Institution of Mechanical Engineers, Part B: Journal of Engineering Manufacture 230:91–99. https://doi.org/10.1177/0954405414542138",
        "He B, Cao JT, He XL, Jin ZX, Fang ML (2012) Lifting Platform in Jack-Up Offshore Platform Based on Virtual Prototyping. AMM:154–157. https://doi.org/10.4028/www.scientific.net/AMM.198-199.154",
        "He B, Song W, Wang Y (2013) A feature-based approach towards an integrated product model in intelligent design. Int J Adv Manuf Technol 69:15–30. https://doi.org/10.1007/s00170-013-4991-0",
        "He B, Song W, Wang Y (2015) Computational Conceptual Design Using Space Matrix. J. Comput. Inf. Sci. Eng. 15:11004. https://doi.org/10.1115/1.4029062",
        "Hmina K, Sallaou M, Ait Taleb A, Lasri L, El Amine M (2021) A preliminary design embodiment analysis through the graph theory implementation. International Journal on Interactive Design and Manufacturing 15:21–33. https://doi.org/10.1007/s12008-020-00706-4",
        "Köhler C (2009) Technische Produktänderungen – Analyse und Beurteilung von Lösungsmöglichkeiten auf Basis einer Erweiterung des CPM/PDD-Ansatzes. Dissertation, Universität des Saarlandes",
        "Künne B, Wieczorek D (2010) Research to optimize the embodiment design of modules and components used in roller conveyors. 2010 IEEE International Conference on Automation and Logistics:495–500. https://doi.org/10.1109/ICAL.2010.5585333",
        "Langeveld L (2011) Product design with embodiment design as a new perspective. In: Coelho D (ed) Industrial design - New frontiers, pp 121–146",
        "Leu MC, Wu JC, Liu XF (2009) Axiomatic functional and object-oriented product design framework. CIRP Annals 58:147–152. https://doi.org/10.1016/j.cirp.2009.03.017",
        "Matthiesen S, Grauberger P, Schrempp L (2019a) Extended Sequence Modelling in Design Engineering - Gaining and Documenting Knowledge about Embodiment Function Relations with the C&C2-Approach. Proc. Int. Conf. Eng. Des. 1:1483–1492. https://doi.org/10.1017/dsi.2019.154",
        "Mokhtarian H, Coatanéa E, Paris H (2017) Function modeling combined with physics-based reasoning for assessing design options and supporting innovative ideation. AIEDAM 31:476–500. https://doi.org/10.1017/S0890060417000403",
        "Morales F, Osorio-Gómez G, Morales J (2022) Proto-Arch: Guidance Tool for Prototyping of Mechanical Systems at the Embodiment Design Phase. Proceedings of the Design Society 2:425–434. https://doi.org/10.1017/pds.2022.44",
        "Muenzer C, Shea K (2017) Simulation-Based Computational Design Synthesis Using Automated Generation of Simulation Models From Concept Model Graphs. J. Mech. Des. 139:71101. https://doi.org/10.1115/1.4036567",
        "Müller JR, Panarotto M, Isaksson O (2019a) Connecting Functional and Geometrical Representations to Support the Evaluation of Design Alternatives for Aerospace. Proc. Int. Conf. Eng. Des. 1:1423–1432. https://doi.org/10.1017/dsi.2019.148",
        "Müller JR, Isaksson O, Landahl J, Raja V, Panarotto M, Levandowski C, Raudberget D (2019b) Enhanced function-means modeling supporting design space exploration. Artificial Intelligence for Engineering Design, Analysis and Manufacturing: AIEDAM 33:502–516. https://doi.org/10.1017/S0890060419000271",
        "Müller JR, Panarotto M, Isaksson O (2020) Design Space Exploration of a Jet Engine Component Using a Combined Object Model for Function and Geometry. Aerospace 7. https://doi.org/10.3390/aerospace7120173",
        "Nagel RL, Stone RB, Hutcheson RS, McAdams DA, Donndelinger JA (2008) Function Design Framework (FDF): Integrated Process and Function Modeling for Complex Systems. In: Proceedings of the ASME 2008 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference. Volume 4: 20th International Conference on Design Theory and Methodology; Second International Conference on Micro- and Nanosystems. ASME, pp 273–286",
        "Rajaguru P, Stoyanov S, Tang YK, Bailey C, Claverley J, Leach R, Topham D (2010) Numerical modelling methodology for design of miniaturised integrated products - an application to 3D CMM micro-probe development. In: 2010 11th International Thermal, Mechanical & Multi-Physics Simulation, and Experiments in Microelectronics and Microsystems (EuroSimE). IEEE, pp 1–8",
        "Rasoulifar G, Prudhomme G, Brissaud D (2012) Coupling Engineering Knowledge With Product Design Knowledge by the Means of Multiple View Product Model. In: Proceedings of the ASME 2012 11th Biennial Conference on Engineering Systems Design and Analysis. Volume 3: Advanced Composite Materials and Processing; Robotics; Information Management and PLM; Design Engineering. ASME, pp 777–783",
        "Riascos R, Levy L, Stjepandić J, Fröhlich A (2015) Digital Mock-up. In: Stjepandić J, Wognum N, J.C. Verhagen W (eds) Concurrent Engineering in the 21st Century. Springer International Publishing, Cham, pp 355–388",
        "Rihtaršič J, Žavbi R, Duhovnik J (2012) Application of wirk elements for the synthesis of alternative conceptual solutions. Res Eng Design 23:219–234. https://doi.org/10.1007/s00163-012-0127-z",
        "Sarkar B, Chakrabarti A, Ananthasuresh GK (2017) Synthesis of feedback-based design concepts for sensors. Res Eng Design 28:131–151. https://doi.org/10.1007/s00163-016-0231-6",
        "Schmitt F, Kirchner E (2022) The quantitative Working Space Model. In: DS 118: Proceedings of Nord Design 2022, pp 1–12",
        "Seybold C, Mantwill F (2021) 3D sketches in virtual reality and their effect on development times. Proceedings of the Design Society 1:1–10. https://doi.org/10.1017/pds.2021.1",
        "Vlah D, Čok V, Urbas U (2021) Vr as a 3d modelling tool in engineering design applications. Applied Sciences (Switzerland) 11. https://doi.org/10.3390/app11167570",
        "Weber C (2005) CPM/PDD - An Extended Theoretical Approach to Modelling Products and Product Development Processes. In: Proceedings of the 2nd German - Israeli Symposium. Fraunhofer-IRB-Verlag, Stuttgart, Germany",
        "Weber C (2014) Modelling Products and Product Development Based on Characteristics and Properties. In: Chakrabarti A, Blessing LTM (eds) An Anthology of Theories and Models of Design: Philosophy, Approaches and Empirical Explorations. Springer London, London, pp 327–352",
        "Wettstein A, Grauberger P, Matthiesen S (2021) Modeling dynamic mechanical system behavior using sequence modeling of embodiment function relations: case study on a hammer mechanism. SN Appl. Sci. 3. https://doi.org/10.1007/s42452-021-04149-8",
        "Wilschut T, Etman LF, Rooda JE, Vogel JA (2018) Generation of a function-component-parameter multi-domain matrix from structured textual function specifications. Res Eng Design 29:531–546. https://doi.org/10.1007/s00163-018-0284-9",
        "Wölkl S, Shea K (2009) A Computational Product Model for Conceptual Design Using SysML. In: Proceedings of the ASME 2009 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference. Volume 2: 29th Computers and Information in Engineering Conference, Parts A and B. ASME, pp 635–645",
        "Zingel C, Albers A, Matthiesen S, Maletz M (2012) Experiences and advancements from one year of explorative application of an integrated model-based development technique using C&C 2-A in SysML. IAENG International Journal of Computer Science 39:165–181"
    ]
}
